
% ------------------------------------------- параметры -------------------------------------------

% размер решетки
x = 150;
y = 150;

% кол-во итераций
number_generation = 1000;

% визуализация
visual = true;

% начальная матрица (пустая, небходимо присвоить значения)
mat = zeros(x, y);

% % генерируем случайные точки
% idx = randsample(numel(mat), numel(mat)/10);
% mat(idx) = 1;

% при матрице(150x150) R-пентамино
mat(75,76) = 1;
mat(75,75) = 1;
mat(76,75) = 1;
mat(77,75) = 1;
mat(76,74) = 1;

% ---------------------------------------------- main ----------------------------------------------

game_of_life(mat, number_generation, visual)
